//задание 1
let Tc = prompt ('Введи значение по Tc');
let a = (9/5)*Tc+32;
alert ('Tf='+ a);

//задание 2
let name = "Василий";
admin = name;
alert (admin);

alert ("Задание 3 и 4 описаны в Source");

/*задание 3
10 + 10 + "10"; склавываются 2 числа преобразовывается в стротроку и происходит конкатенация строк
10 + "10" + 10; происходит соложение строк
10 + 10 + +"10"; складываются все числа так как стоят два знака ++
10 / -""; пытка деления на 0
10 / +"2,5"; выводится NaN, 2,5 является string


//Задание 4
let mode = "normal"; //корректное наименование на английском
let my_valu3 = 102;//корректное наименование на английском
let 3my_value3 = "102";//некорректное начинается с цыфры
let __hello__ = "world";//корректное начинается с нижнего подчеркивания
let $$$ = "money";//корректное начинается со знака $
let !0_world = true;//некорректное начинается с ! знака
*/